app/controllers/login_controller.rb

  def login
    #session[:user_id] = nil
    if request.post?
      user = User.authenticate(params[:login], params[:pw])
      if user #!= nil
        flash[:notice] = "Welcome, #{user.first_name}!"
---
SELECT * FROM "users" WHERE ("users"."login" = 'lskywalker') LIMIT 1