app/controllers/posts_controller.rb

  def index
    @posts = Post.find(:all, :conditions => "response_id IS NULL OR response_id <= 0") # TODO put newest first
---
SELECT * FROM "posts" WHERE (response_id IS NULL OR response_id <= 0)

  def add_cheer
    @user_id_in_session = session[:user_id]
    @cheer = Cheer.create(:user_id => @user_id_in_session, :post_id => params[:post_id] )
---
INSERT INTO "cheers" ("created_at", "updated_at", "post_id", "user_id") VALUES('2010-11-02 22:18:57', '2010-11-02 22:18:57', 3, 15)

  def delete_cheer
    @post_id = params[:post_id]
    @user_id = session[:user_id]
    @cheer = Cheer.find_by_post_id_and_user_id(@post_id, @user_id)
    @cheer.destroy
---
SELECT * FROM "cheers" WHERE ("cheers"."user_id" = 15 AND "cheers"."post_id" = '3') LIMIT 1
DELETE FROM "cheers" WHERE "id" = 65

  def view_responses
    if request.get?
      @responses = Post.find(:all, :conditions => "response_id = #{params[:id]}") # TODO put newest first
---
SELECT * FROM "posts" WHERE (response_id = id)